
  var randomScalingFactor = function() {
    return Math.round(Math.random() * 100);
};
var randomColorFactor = function() {
    return Math.round(Math.random() * 255);
};

var config = {
    type: 'doughnut',
    data: {
     //最四圈（最外圈，最終收取結果）
        datasets: [{
            data: [
                14,/*敵方*/
                4.9,/*外資得票*/
                3,/*內外資未投票*/
                0.3,/*內資得票*/
                24,/*森友會*/
                9,/*未知*/
                10,/*敵方*/
                2.8,/*未知*/
                32/*森友會*/
            ],
                backgroundColor: [
                "#E56C37",/*橘*/
                "#44B525",/*綠*/
                "#999999",/*灰*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#999999",/*灰*/
                "#E56C37",/*橘*/
                "#999999",/*灰*/
                "#44B525"/*綠*/


            ],
        }, {
            data: [
                100
            ],
                backgroundColor: [
                "#FFFFFF",/*橘*/



            ],
        }, {
            data: [
                14,/*敵方*/
                7,/*外資*/
                1.2,/*內資*/
                18,/*表示支持的散戶*/
                24,/*未知*/
                5,/*中立*/
                6,/*新夥伴*/
                5,/*光洋*/
                4.8,/*XX*/
                3,/*黃總*/
                2.2,/*張景翊*/
                2.1,/*馬博*/
                1.2,/*其他股東*/
                1,/*其他股東*/
                1,/*其他股東*/
                0.5,/*其他股東*/
                0.5,/*其他股東*/
                0.5,/*其他股東*/
                0.2,/*其他股東*/
                0.5,/*其他股東*/
                0.8,/*其他股東*/
                0.4,/*其他股東*/
                0.6,/*其他股東*/
                0.5,/*其他股東*/
            ],
                backgroundColor: [
                "#E56C37",/*橘*/
                "#2A3FD3",/*外資*/
                "#40B2E7",/*內資*/
                "#44B525",/*綠*/
                "#999999",/*灰*/
                "#999999",/*灰*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525"/*綠*/
            ],
        }, {
        //第三圈
            data: [
                9,/*台鋼*/
                7,/*外資*/
                1.2,/*內資*/
								59.3,/*未知*/
                5,/*光洋*/
                4.8,/*XX*/
                3,/*黃總*/
                2,/*張景翊*/
                2.1,/*馬博*/
                1.1,/*其他股東*/
                0.5,/*其他股東*/
                0.4,/*其他股東*/
                0.5,/*其他股東*/
                0.6,/*其他股東*/
                0.5,/*其他股東*/
                0.4,/*其他股東*/
                0.3,/*其他股東*/
                0.7,/*其他股東*/
                0.5,/*其他股東*/
                0.5,/*其他股東*/
                0.6/*其他股東*/

            ],
                backgroundColor: [
                "#E56C37",/*橘*/
                "#2A3FD3",/*外資*/
                "#40B2E7",/*內資*/
                "#999999",/*灰*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525",/*綠*/
                "#44B525"/*綠*/
            ],
        }, {
            data: [
                8,
                68.5,
                23.5
            ],
                backgroundColor: [
                "#E56C37",/*橘*/
                "#999999",/*灰*/
                "#44B525",/*綠*/
            ],
        }],
        labels: [
            "敵軍",
            "友軍",
            "未知",
        ]
    },
    options: {
        responsive: true
    }
};

var ctx = document.getElementById("chart-area").getContext("2d");
var myDoughnut = new Chart(ctx, config);
